# -*- coding: utf-8 -*-

# rhyme_sheet.py

mainTypeEnum = ["平聲(上)", "平聲(下)", "上聲", "去聲", "入聲"]
secondTypeEnum = [
    ["一東", "二冬", "三江", "四支", "五微", "六魚", "七虞", "八齊", "九佳",
     "十灰", "十一眞", "十二文", "十三元", "十四寒", "十五删"],
    # 上平声
    ["一先", "二蕭", "三肴", "四豪", "五歌", "六麻", "七陽", "八庚", "九靑",
     "十蒸", "十一尤", "十二侵", "十三覃", "十四鹽", "十五咸"],
    # 下平声
    ["一董",     "二腫",     "三講",     "四紙",     "五尾",     "六語",
     "七麌",     "八薺",     "九蟹",     "十賄",     "十一軫",   "十二吻",
     "十三阮",   "十四旱",   "十五潸",   "十六銑",   "十七筱",   "十八巧",
     "十九皓",   "二十哿",   "二十一馬", "二十二養", "二十三梗", "二十四迥",
     "二十五有", "二十六寢", "二十七感", "二十八儉", "二十九豏"],
    # 上声
    ["一送",     "二宋",     "三絳",     "四寘",     "五未",
     "六御",     "七遇",     "八霽",     "九泰",     "十卦",
     "十一隊",   "十二震",   "十三問",   "十四願",   "十五翰",
     "十六諫",   "十七霰",   "十八嘯",   "十九效",   "二十號",
     "二十一个", "二十二禡", "二十三漾", "二十四敬", "二十五徑",
     "二十六宥", "二十七沁", "二十八勘", "二十九艷", "三十陷"],
    # 去声
    ["一屋", "二沃", "三覺", "四質", "五物", "六月", "七曷", "八黠", "九屑",
     "十藥", "十一陌", "十二錫", "十三職", "十四緝", "十五合", "十六葉",
     "十七洽"]
    # 入声
]
